exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/esb_insertDataToDataExtension_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.exacttarget"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header />
   <soapenv:Body>
      <urn:accessToken>%s(accessToken)</urn:accessToken>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:createOptions>
         <Options>
            <CallsInConversation>100</CallsInConversation>
            <ConversationID>%s(esbDataExtensionConversationId)</ConversationID>
            <RequestType>Asynchronous</RequestType>
            <SequenceCode>25</SequenceCode>
         </Options>
      </urn:createOptions>
      <urn:dataExtensionObjects>
         <Objects xsi:type="DataExtensionObject">
            <ObjectID xsi:nil="true" />
            <CustomerKey>%s(dataExtCustomerKey)</CustomerKey>
            <Properties>
               <Property>
                  <Name>%s(dataExtField1)</Name>
                  <Value>%s(currentTimeString)</Value>
               </Property>
               <Property>
                  <Name>%s(dataExtField2)</Name>
                  <Value>%s(currentTimeString)</Value>
               </Property>
            </Properties>
         </Objects>
      </urn:dataExtensionObjects>
      <urn:method>insertDataToDataExtension</urn:method>
   </soapenv:Body>
</soapenv:Envelope>